# Формат такой {"" : ["", ""]}. ["word"][0] - хирагана, ["word"][1] - перевод/описание.

KANZI_WITH_LOVE = {
    # по делу надо юзать предложения.

    # 山
    "山":       ["やま", "гора"],
    "富士山":   ["ふじさん", "гора фудзи"],
    "山田さん": ["やまださん", "гос. Ямада."],
    "山下さん": ["やましたさん", "гос. Ямшита."],
    "火山":     ["かざん", "вулкан"],

    # 川
    "川":         ["かわ", "река"],
    "モスクワ川": ["モスクワかわ", "москва река."],
    "ネウア川":   ["ネウアかわ", "река нева"],
    "山川さん":   ["やまかわさん", "гос. Ямакава."],
    "田んぼ":     ["たんぼ", "рисовое поле."],
    "川田さん":   ["かわださん", "гос. Кавада."],

    # 日
    "日":     ["ひ", "солнце."],
    "母の日": ["ははのひ", "день матери"],
    "日曜日": ["にちようび", "воскресенье (день солнца)"],
    "日本":   ["にほん", "Япония."],
    "休日":   ["きゅうじつ", "выходной день."],
    "平日":   ["へいじつ", "будний день."],
    "1日":    ["ついたち", "1-е число или いちにち один день"],
    "2日":    ["ふつか", "2-е число."],
    "3日":    ["みっか", "3-е число."],
    "4日":    ["よっか", "4-е число."],
    "15日":   ["じゅうごにち", "15 число."],

    # 月
    "月":     ["つき", "луна."],
    "月曜日": ["げつようび", "понедельник (лунный день)"],
    "１月":   ["いちがつ", "январь."],
    "２月":   ["にがつ", "февраль."],
    "１か月": ["いっかげつ", "один месяц."],
    "３か月": ["さんかげつ", "три месяца."],

    #火
    "火曜日" : ["かようび", "вторник (огненный день)"],
    "火事" : ["かじ", "пожар [огонь][проишествие/факт/обстоятельство]"],
    "水" : ["みず", "вода"],
    "水曜日" : ["すいようび", "среда (водный день)"],
    "水道" : ["すいどう", "водопровод (водный путь)"],

    # 木
    "木" : ["き", "дерево"],
    "木曜日" : ["もくようび", "четверг (деревянный день)"],

    # 金
    "金" : ["きん", "золото"],
    "お金" : ["おかね", "деньги"],
    "金曜日" : ["きんようび", "пятница (золотой день)"],
    "金田さん" : ["かねださん", "гос. Канеда."],

    # 土
    "土" : ["つち", "земля, почва"],
    "土曜日" : ["どようび", "суббота"],
    "土田さん" : ["つちださん", "гос. Цучида."],

    # 百
    "百　三百　六百　八百" : ["ひゃく さんびゃく　ろっぴゃく　はっぴゃく", "сто триста шестсовт восемьсот"],

    #千
    "一千　三千" : ["いちせん　さんぜん", "тысяча три тысячи"],

    #万
    "一万" : ["いちまん", "десять тысяч"],

    #円
    "円" : ["えん", "йена"],

    #年
    "4年" : ["よねん", "4 года"],
    "今年" : ["ことし", "этот год"],
    "同じ年" : ["おなじどし", "одногодки [одиноковый][год]"],

    #上
    "年上" : ["としうえ", "старший по возрасту　[возраст][верх]"],
    "上手[な]" : ["じょうず[な]", "умелый"],
    "屋上" : ["おくじょう", "На крыше"],
    "上" : ["うえ", "верх, сверху"],
    "上着" : ["うわぎ", "верхняя одежда"],
    "村上さん" : ["むらかみさん", "гос. Мураками."],
    "上げます" : ["あげます", "поднимать повышать"],
    "上がります" : ["あがります", "подниматься повышаться"],

    # 下
    "どうぞお上がりください" : ["どうぞおあがりください", "проходите пожалуйста"],
    "地下" : ["ちか", "подземный"],
    "地下鉄" : ["ちかてつ", "метро"],
    "下" : ["した", "низ"],
    "下着" : ["したぎ", "нижнее бельё"],
    "靴下" : ["くつした", "носки"],
    "下げます" : ["さげます", "спускать снижать"],
    "下がります" : ["さがります", "спускаться снижаться"],
    "お下げしてよろしいですか" : ["おさげしてよろしいですか", "Разрешите убрать посуду."],

    #　中
    "中国" : ["ちゅうごく", "Китай"],
    "中心" : ["ちゅうしん", "центр"],
    "中" : ["なか", "внутри, середина"],
    "田中さん" : ["たなかさん", "гос. Танака"],
    "二時半" : ["にじはん", "2:30 ч"],
    "四時間半" : ["よじかんはん", "4 с половиной часа. (промежуток)"],
    "半分" : ["はんぶん", "половина"],
    "一分 九分" : ["いっぷん　きゅうふん", "одна минута, девять минут"],
    "分かります" : ["わかります", "понимать, знать"],
    "分けます" : ["わけます", "Делить, разделять"],

    # 人
    "ロシア人" : ["ロシア人", "Руссиянин"],
    "大人" : ["おとな", "взрослый"],
    "一人　二人　三人" : ["ひとり　ふたり　さんにん", "Один человек, два ... три ..."],

    # 子
    "子供" : ["[こ]ども", "Ребёнок"],
    "女の子" : ["おんなのこ", "Девочка"],
    "男の子" : ["おとこのこ", "Мальчик"],
    "女子" : ["じょし", "Девушка"],
    "男子" : ["だんし", "Юныша"],
    "[電子]辞書" : ["[でんし]じしょ", "[Электронный] словарь"],

    # 女
    "女の人" : ["[おんな]のひと", "Женщина"],
    "彼女" : ["かのじょ", "Герлфренд, она"],

    # 力
    "力" : ["ちから", "сила"],
    "能力" : ["のうりょく", "способность, возможность"],

    #男
    "男の人" : ["おとこのひと", "мужчина"],
    "男子学生" : ["だんしがくせい", "студент"],
    "男性" : ["だんせい", "Мужской пол"],

    #目
    "目" : ["め", "глаз"],
    "目上の人" : ["[め]うえのひと", "Начальник, вышестоящий"],
    "目薬" : ["めぐすり", "Глазные капли/лекарство"],
    "目次" : ["もくじ", "Оглавление/Содержание"],

    #口
    "口" : ["くち", "рот"],
    "入口" : ["いりぐち", "вход, въезд"],
    "出口" : ["でぐち", "выход, выезд"],
    "山口さん" : ["やま[ぐち]さん", "гос. Ямагучи"],
    "人口" : ["じんこう", "население"],

    #耳
    "耳" : ["みみ", "ухо"],
    "耳鼻科" : ["じびか", "ушной врач, отоларингология"],

    # 手
    "手" : ["て", "рука"],
    "手紙" : ["[て]がみ", "Письмо. Рука-бумага."],
    "運転手" : ["うんてんしゅ", "Водитель"],
    "下手な" : ["へたな", "Не умелый"],

    # 足
    "足" : ["あし", "нога"],
    "一足　二足　三足" : ["いっそく　にそく　さんぞく", "Один парный предмет на ноги, два, три"],
    "足ります" : ["たります", "Хватать, в достаточно колличестве"],
    "時間が足りません" : ["じかんがたりません", "Не хватает времени"],
    "" : ["", ""],

}

GENKI_KANGI = {
    "会話": ["かいわ", "разговор\\беседа"],
    "週末" : ["しゅうまつ", "Выходной [недели] [конец]"],
    "何" : ["なに", "что?"],
    "勉強" : ["べんきょう", "занятия наукой\\учёба"],
    "映画" : ["えいが", "Кино\\худ. Фильм."],
    "早い" : ["はやい", "Ранний\\быстрый"],
    "今日" : ["きょう", "сегодня [сейчас][день]"],
    "京都" : ["きょうと", "Киото [столица][столица]"],
    "行きます" : ["いきます", "Идти (сейчас или потом)"],
    "何時" : ["なんじ", "когда?[какое][время] конкретное время."],
    "帰る" : ["かえる", "возвращаться, уходить домой"],
    "晩ご飯　｜　晩飯" : ["ばんごはん (вежл) ｜ ばんめし", "ужин[вечер\\закат][приём пищи]"],
    "食べません" : ["たべません", "Есть не буду."],
    "寝る" : ["ねる", "спать\\ложится спать"],
    "起きる" : ["おきる", "вставать\\просыпаться"],
    "帽子" : ["ぼうし", "шапка"],
    "" : ["", ""],
}

WORDS_TO_LEARN = {
    "たいてい": ["たいてい", "обычно\\чаще всего"],
    "そうですね" : ["そうですね", "ды, согласен\\Согласие со сказанным. "],
    "うち" : ["うち", "дом\\семья"],
    "でも" : ["でも", ", но"],
    "ときどき" : ["ときどき", "иногда\\порой"],
    "みる" : ["みる", "смотреть"],
    "ええ" : ["ええ", "Да"],
    "いいえ" : ["いいえ", "нет"],
    "*ごろ" : ["*ごろ", "*примерно"],
    "じゃあ、いってらっしゃい" : ["じゃあ、いってらっしゃい", "Да и ладно, иди. (Усиленная форма)"],
    "" : ["", ""],

}

KANGI_SET = {}
KANGI_SET.update(KANZI_WITH_LOVE)
KANGI_SET.update(GENKI_KANGI)
KANGI_SET.update(WORDS_TO_LEARN)