# Формат такой {"" : ["", ""]}. ["word"][0] - хирагана, ["word"][1] - перевод/описание.

KANZI_WITH_LOVE_N5 = {
    # по делу надо юзать предложения.

    # 山
    "山":       ["やま", "гора"],
    "富士山":   ["ふじさん", "гора фудзи"],
    "山田さん": ["やまださん", "гос. Ямада."],
    "山下さん": ["やましたさん", "гос. Ямшита."],
    "火山":     ["かざん", "вулкан"],

    # 川
    "川":         ["かわ", "река"],
    "モスクワ川": ["モスクワかわ", "москва река."],
    "ネウア川":   ["ネウアかわ", "река нева"],
    "山川さん":   ["やまかわさん", "гос. Ямакава."],
    "田んぼ":     ["たんぼ", "рисовое поле."],
    "川田さん":   ["かわださん", "гос. Кавада."],

    # 日
    "日":     ["ひ", "солнце."],
    "母の日": ["ははのひ", "день матери"],
    "日曜日": ["にちようび", "воскресенье (день солнца)"],
    "日本":   ["にほん", "Япония."],
    "休日":   ["きゅうじつ", "выходной день."],
    "平日":   ["へいじつ", "будний день."],
    "1日":    ["ついたち", "1-е число или いちにち один день"],
    "2日":    ["ふつか", "2-е число."],
    "3日":    ["みっか", "3-е число."],
    "4日":    ["よっか", "4-е число."],
    "15日":   ["じゅうごにち", "15 число."],

    # 月
    "月":     ["つき", "луна."],
    "月曜日": ["げつようび", "понедельник (лунный день)"],
    "１月":   ["いちがつ", "январь."],
    "２月":   ["にがつ", "февраль."],
    "１か月": ["いっかげつ", "один месяц."],
    "３か月": ["さんかげつ", "три месяца."],

    #火
    "火曜日" : ["かようび", "вторник (огненный день)"],
    "火事" : ["かじ", "пожар [огонь][проишествие/факт/обстоятельство]"],
    "水" : ["みず", "вода"],
    "水曜日" : ["すいようび", "среда (водный день)"],
    "水道" : ["すいどう", "водопровод (водный путь)"],

    # 木
    "木" : ["き", "дерево"],
    "木曜日" : ["もくようび", "четверг (деревянный день)"],

    # 金
    "金" : ["きん", "золото"],
    "お金" : ["おかね", "деньги"],
    "金曜日" : ["きんようび", "пятница (золотой день)"],
    "金田さん" : ["かねださん", "гос. Канеда."],

    # 土
    "土" : ["つち", "земля, почва"],
    "土曜日" : ["どようび", "суббота"],
    "土田さん" : ["つちださん", "гос. Цучида."],

    # 百
    "百　三百　六百　八百" : ["ひゃく さんびゃく　ろっぴゃく　はっぴゃく", "сто триста шестсовт восемьсот"],

    #千
    "一千　三千" : ["いちせん　さんぜん", "тысяча три тысячи"],

    #万
    "一万" : ["いちまん", "десять тысяч"],

    #円
    "円" : ["えん", "йена"],

    #年
    "4年" : ["よねん", "4 года"],
    "今年" : ["ことし", "этот год"],
    "同じ年" : ["おなじどし", "одногодки [одиноковый][год]"],

    #上
    "年上" : ["としうえ", "старший по возрасту　[возраст][верх]"],
    "上手[な]" : ["じょうず[な]", "умелый"],
    "屋上" : ["おくじょう", "На крыше"],
    "上" : ["うえ", "верх, сверху"],
    "上着" : ["うわぎ", "верхняя одежда"],
    "村上さん" : ["むらかみさん", "гос. Мураками."],
    "上げます" : ["あげます", "поднимать повышать"],
    "上がります" : ["あがります", "подниматься повышаться"],

    # 下
    "どうぞお上がりください" : ["どうぞおあがりください", "проходите пожалуйста"],
    "地下" : ["ちか", "подземный"],
    "地下鉄" : ["ちかてつ", "метро"],
    "下" : ["した", "низ"],
    "下着" : ["したぎ", "нижнее бельё"],
    "靴下" : ["くつした", "носки"],
    "下げます" : ["さげます", "спускать снижать"],
    "下がります" : ["さがります", "спускаться снижаться"],
    "お下げしてよろしいですか" : ["おさげしてよろしいですか", "Разрешите убрать посуду."],

    #　中
    "中国" : ["ちゅうごく", "Китай"],
    "中心" : ["ちゅうしん", "центр"],
    "中" : ["なか", "внутри, середина"],
    "田中さん" : ["たなかさん", "гос. Танака"],
    "二時半" : ["にじはん", "2:30 ч"],
    "四時間半" : ["よじかんはん", "4 с половиной часа. (промежуток)"],
    "半分" : ["はんぶん", "половина"],
    "一分 九分" : ["いっぷん　きゅうふん", "одна минута, девять минут"],
    "分かります" : ["わかります", "понимать, знать"],
    "分けます" : ["わけます", "Делить, разделять"],

    # 人
    "ロシア人" : ["ロシアじん", "Россиянин"],
    "大人" : ["おとな", "взрослый"],
    "一人　二人　三人" : ["ひとり　ふたり　さんにん", "Один человек, два ... три ..."],

    # 子
    "子供" : ["[こ]ども", "Ребёнок"],
    "女の子" : ["おんなのこ", "Девочка"],
    "男の子" : ["おとこのこ", "Мальчик"],
    "女子" : ["じょし", "Девушка"],
    "男子" : ["だんし", "Юныша"],
    "[電子]辞書" : ["[でんし]じしょ", "[Электронный] словарь"],

    # 女
    "女の人" : ["[おんな]のひと", "Женщина"],
    "彼女" : ["かのじょ", "Герлфренд, она"],

    # 力
    "力" : ["ちから", "сила"],
    "能力" : ["のうりょく", "способность, возможность"],

    #男
    "男の人" : ["おとこのひと", "мужчина"],
    "男子学生" : ["だんしがくせい", "студент"],
    "男性" : ["だんせい", "Мужской пол"],

    #目
    "目" : ["め", "глаз"],
    "目上の人" : ["[め]うえのひと", "Начальник, вышестоящий"],
    "目薬" : ["めぐすり", "Глазные капли/лекарство"],
    "目次" : ["もくじ", "Оглавление/Содержание"],

    #口
    "口" : ["くち", "рот"],
    "入口" : ["いりぐち", "вход, въезд"],
    "出口" : ["でぐち", "выход, выезд"],
    "山口さん" : ["やま[ぐち]さん", "гос. Ямагучи"],
    "人口" : ["じんこう", "население"],

    #耳
    "耳" : ["みみ", "ухо"],
    "耳鼻科" : ["じびか", "ушной врач, отоларингология"],

    # 手
    "手" : ["て", "рука"],
    "手紙" : ["[て]がみ", "Письмо. Рука-бумага."],
    "運転手" : ["うんてんしゅ", "Водитель\n[судьба うん][поворачиваться てん][рука しゅ]"],
    "下手な" : ["へたな", "Не умелый"],

    # 足
    "足" : ["あし", "нога"],
    "一足　二足　三足" : ["いっそく　にそく　さんぞく", "Один парный предмет на ноги, два, три"],
    "足ります" : ["たります", "Хватать, в достаточно колличестве"],
    "時間が足りません" : ["じかんがたりません", "Не хватает времени"],

    # 父
    "父" : ["ちち", "Папа"],
    "お父さん" : ["おとうさん", "Папа - обращение"],
    "父親" : ["ちちおや", "Чей то папа\n[папа - ふ][родитель - しん]"],
    "祖父" : ["そふ", "Дедушка - свой"],

    # 母
    "母" : ["はは", "Мама (своя)"],
    "お母さん" : ["おかあさん", "Обращение - чьято мать"],
    "母親" : ["ははおや", "Мама - понятие \n [мать -　ぼ][родитель - しん]"],
    "祖母" : ["そぼ", "Бабушка (своя)\n[предок そ]"],
    "母国" : ["ぼこく", "Родина\n[Мать ぼ][Страна こく]"],
    "母国語" : ["ぼこくご", "Родной язык"],

    #
    "先生" : ["せんせい", "Учитель\n[впереди せん][жизнь せい]"],
    "先月" : ["せんげつ", "Прошлый месяц"],
    "先週" : ["せんしゅう", "Прошлая неделя"],
    "先日" : ["せんじつ", "Недавно [впереди せん][день にち]"],
    "先輩" : ["せんぱい", "Старший товарищ [впереди せん][товарищ はい]"],
    "お先に失礼します。" : ["お[さき]に[しつ][れい]します", "Извините, что ухажу раньше вас. \n [Раньше　せん][Теряю　しつ][Этикет　れい]"],
    "お先にどうぞ" : ["お[さき]のどうぞ", "Начинайте без меня/Проходите вперёд. \n[впереди せん]"],
    "連絡先" : ["れん[らく]さき", "Контактные данные\n[Брать れん][Зацепляться らく][Впереди せん]"],

    # 生
    "学生" : ["がくせい", "Ученик, студент\n[Учёба][Рождённый]"],
    "生活" : ["せいかつ", "Жизнь, быт\n[Жизнь せい][Живой かつ]"],
    "生物学" : ["せいぶつがく", "Биология\n[Жизнь せい][Вещь ぶつ][Учёба がく]"],
    "生年月日" : ["せいねんがっぴ", "Дата рождения"],
    "誕生日" : ["たん[じょう]び", "День рождения\n[родиться たん][жизнь せい][день にち]"],
    "生け花" : ["いけばな", "Икебана\n[][]"],
    "生まれます" : ["うまれます", "Рождаться (где, когда)\n[жизнь せい]"],
    "生魚" : ["なまざかな", "Сырая рыба\n[Жизнь せい][Рыба ぎょ]"],
    "生ビール" : ["なまびーる", "Разливное пиво"],

    #　学
    "大学" : ["だいがく", "Университет\n[Большой だい][Учёба がく]"],
    "学部" : ["がくぶ", "Факультет\n[Учиться][Сектор]"],
    "文学" : ["ぶんがく", "Литература\n[Литература/культура　ぶん][Учиться　がく]"],
    "数学" : ["すうがく", "Математика\n[Число][Учиться]"],
    "化学" : ["かがく", "Химия\n[Превращаться か][Учиться がく]"],

    # 校
    "学校" : ["がっこう", "Школа\n[Учиться][Школа]"],

    # 友
    "友達" : ["ともだち", "\nДруг[Друг ゆう][Достигать たつ]"],

    # 本
    "本" : ["ほん", "Крига"],
    "本当" : ["ほんとう", "Правда\n[Корень][Данный]"],
    "山本さん" : ["やまもとさん", "\n[][]"],
    "一本　三本 九本　十本" : ["いっぽん　さんぼん \nきゅうほん　じゅっぽん", "\nОдин продолговатый и длинный, три, "
                                                "\n　девять, десять \n "],

    # 毎
    "毎朝" : ["まいあさ", "Каждое утро\n[каждое まい][утро ちょう]"],
    "毎日" : ["まいにち", "Каждый день\n[][]"],
    "毎晩" : ["まいばん", "Каждый вечер\n[まい][ばん]"],
    "毎年" : ["まいとし｜まいねん", "Каждый год\n[][]"],
    "毎週" : ["まいしゅう", "Каждую неделю\n[][]"],
    "毎月" : ["まいつき", "Каждый месяц\n[][]"],

    # 何
    "何か" : ["なにか", "Что-то"],
    "何も" : ["なにも", "Ничего"],
    "何でも" : ["なんでも", "Что угодно, всё"],

    # 前
    "前" : ["まえ", "Впереди\n[][]"],
    "食事の前" : ["しょくじのまえ", "Перед едой\n[Еда しょく][Дело じ][Впереди 前]"],
    "名前" : ["なまえ", "Имя\n[Имя めい][Впереди 前]"],
    "午前" : ["ごぜん", "Первая половина дня\n[полдень ご][Впереди 前]"],

    # 後
    "後" : ["あと", "\nПотом, после[после あと]"],
    "じゃ、また後で" : ["じゃ、またあとで", "Пока, до встречи\n[после あと]"],
    "後ろ" : ["うしろ", "\n[после あと]"],
    "車の後ろ" : ["くるまのうしろ", "\n[повозка しゃ,　автомобиль くるま][после あと]"],
    "午後" : ["ごご", "\nВторая половина дня \n[полдень ご][после あと]"],
    "三日後" : ["みっかご", "Через три дня\n[после あと]"],

    # 外
    "外" : ["そと", "Снаружи, на улице \n[снаружи がい]"],
    "外国" : ["がいこく", "Иностранный\n[снаружи がい][страна こく]"],
    "外国語" : ["がいこくご", "Иностранный язык\n[снаружи がい][страна こく][язык ご]"],
    "外国人" : ["がいこくじん", "Иностранец\n[снаружи がい][страна こく][человек じん]"],

    #　左
    "左" : ["ひだり", "Слева\n[слева ひだり]"],
    "左利き" : ["ひだりきき", "Левша\n[слева ひだり][Действовать り]"],
    "左右" : ["さゆう", "Слева и справа\n[левый ひだり][правый みぎ]"],

    #　右
    "右手" : ["みぎて", "Правая рука\n[правый みぎ][рука て]"],
    "右足" : ["みぎあし", "Правая нога\n[правый みぎ][нога あし]"],

    # 東
    "東" : ["ひがし", "Восток"],
    "東京" : ["とうきょう", "Токио\n[Восток ひがし][Столица きょう]"],
    "東口" : ["ひがしぐち", "Восточный выход\n[Восток ひがし][рот　こう/くち]"],

    # 西
    "西" : ["にし", "Запад"],
    "西口" : ["にしぐち", "Западный выход\n[запад にし][рот　こう/くち]"],
    "大西洋" : ["たいせいよう", "Атлантический океан\n[Большой だい][запад にし][океан よう]"],

    # 南
    "南" : ["みなみ", "Юг"],
    "南口" : ["みなみぐち", "Южный выход\n[юг みなみ][рот　こう/くち]"],
    "南米" : ["なんべい", "Южная америка\n[юг みなみ][рис べい]"],
    "東南アジア" : ["とうなんアジア", "Юго-восточная азия\n[Восток ひがし][юг みなみ]"],

    #　北
    "北" : ["きた", "Север"],
    "北口" : ["きたぐち", "Северный выход\n[север きた][рот　こう/くち]"],
    "北海道" : ["ほっかいどう", "Хокайдо\n[север きた][море かい][дорога どう]"],
    "北米" : ["ほくべい", "Северная америка\n[север きた][рис べい]"],
    "北西" : ["ほくせい", "Северо запад\n[север きた][запад にし]"],
    "北東" : ["ほくとう", "Северо восток\n[север きた][Восток ひがし]"],
    "南西" : ["なんせい", "Юго запад\n[юг みなみ][запад にし]"],
    "南東" : ["なんとう", "Юго восток\n[юг みなみ][Восток ひがし]"],

    # 名
    "名古屋" : ["なごや", "гор. Нагоя\n[имя な][старый こ][здание おく/や]"],
    "有名な" : ["ゆうめいな", "Известный\n[иметь ゆう][имя な]"],
    "名詞" : ["めいし", "Сущевствительное\n[имя な][слово し]"],
    "名刺" : ["めいし", "Визитка\n[имя な][вонзать し]"],
    "氏名" : ["しめい", "Фамилия и имя (анкета)\n[господин し][имя な]"],
    "名字" : ["みょうじ", "Фамилия\n[имя な][иероглиф じ]"],
    "何名様ですか" : ["なんめいさまですか", "Сколько вас человек? (в ресторане)\n[что, чего なん][имя な][вот так よう]"],

    # 牛
    "牛"   : ["うし", "Корова, бык\n"],
    "牛乳" : ["ぎゅうにゅう", "Молоко\n[うし-корова][にゅう-молоко]"],
    "牛肉" : ["ぎゅうにく", "Гомядина\n[うし-корова][にく-мясо]"],
    "牛丼" : ["ぎゅうどん", "Гюдон\n[うし-корова][どん-миска]"],

    # 馬
    "馬" : ["うま", "Логадь\n"],
    "子馬" : ["こうま", "Пони, жеребёнок\n[し-ребёнок][うま-лошадь]"],
    "馬車" : ["ばしゃ", "Лошадиная повозка\n[うま-лошадь][くるま-повозка]"],
    "馬鹿" : ["ばか", "Дурак\n[うま-лошадь][ろく-лошадь]"],

    # 魚
    "魚" : ["さかな", "Рыба\n"],
    "魚屋" : ["さかなや", "Рыбная лавка\n[さかな-рыба][おく-здание]"],
    "焼き魚" : ["やきざかな", "Жаренная рыба\n[しょう-сжигать][さかな-рыба]"],
    "金魚" : ["きんぎょ", "Золотая рыбка\n[きん-золото][さかな-рыба]"],
    "人魚" : ["にんぎょ", "Русалка\n[にん-человек][さかな-рыба]"],

    # 貝
    "貝" : ["かい", "Молюск"],
    "貝がら" : ["かいがら", "Ракушка\n[かい-Молюск]"],

    # 雨
    "雨"   : ["あめ", "Дождь"],
    "大雨" : ["おおあめ", "Ливень\n[だい-большой][あめ-Дождь]"],
    "雨水" : ["あまみず", "Дождевая вода\n[あめ-Дождь][みず-вода]"],
    "梅雨" : ["つゆ", "Сезон дождей\n[うめ-слива][あめ-Дождь]"],

    # 天
    "天気" : ["てんき", "Погода\n[てん-небо][き-пар, воздух, энергия]"],
    "天使" : ["てんし", "Ангел\n[てん-небо][し-применять, заниматься, принимать]"],
    "天国" : ["てんごく", "Рай\n[てん-небо][こく-страна]"],
    "天才" : ["てんさい", "Гений\n[てん-небо][さい-талант]"],
    "天皇" : ["てんのう", "Император\n[てん-небо][こう-император]"],
    "天の川" : ["あまのがわ", "Млечный путь\n[てん-небо][かわ-река]"],

    # 気
    "元気な" : ["げんきな", "Здоровый\n[もと-начало, изначальный][き-пар, воздух, энергия]"],
    "病気" : ["びょうき", "Болезнь\n[びょう-болеть, недомогание, слабость][き-пар, воздух, энергия]"],
    "気持ち" : ["きもち", "Чувства, настроение\n[き-пар, воздух, энергия][もつ-держать]"],
    "電気" : ["でんき", "Электро-ток\n[でん-электричество][き-пар, воздух, энергия]"],
    "人気" : ["にんき", "Популярность\n[にん-человек][き-пар, воздух, энергия]"],

    # 車
    "車" : ["くるま", "Телега, машина"],
    "自動車" : ["じどうしゃ", "\nАвтомабиль[じ-сам][どう-двигаться][くるま-телега]"],
    "自転車" : ["じてんしゃ", "Велосипед\n[じ-сам][てん-поворачиватся, переходить, катиться][くるま-телега]"],
    "電車"   : ["でんしゃ", "Поезда\n[でん-электричество][くるま-телега]"],
    "駐車場" : ["ちゅうしゃじょう", "Парковка\n[ちゅう-пребывать, находится][くるま-телега][ば\じょう место]"],
    "救急車" : ["きゅうきゅうしゃ", "Машина скорой помощи\n[きゅう-спасать][きゅう-срочность, внезапность][くるま-телега]"],

    # 門
    "門" : ["もん", "Ворота"],
    "専門" : ["せんもん", "специальность\n[][もん-ворота]"],
    "門松" : ["かどまつ", "Украшение из сосновых веток и бамбука\n[もん-ворота][]"],
    "笑う門に福が来る" : ["わらうかどにふくがくる", "В дом где смеются приходит счастье\n[しょう-смех][もん-ворота]\n[ふく-счастье][らい-приходить]"],

    "" : ["", "\n[][][]"],

}

GENKI_KANGI = {
    "会話": ["かいわ", "разговор\\беседа"],
    "週末" : ["しゅうまつ", "Выходной [недели] [конец]"],
    "何" : ["なに", "что?"],
    "勉強" : ["べんきょう", "занятия наукой\\учёба"],
    "映画" : ["えいが", "Кино\\худ. Фильм."],
    "早い" : ["はやい", "Ранний\\быстрый"],
    "今日" : ["きょう", "сегодня [сейчас][день]"],
    "京都" : ["きょうと", "Киото [столица][столица]"],
    "行きます" : ["いきます", "Идти (сейчас или потом)"],
    "何時" : ["なんじ", "когда?[какое][время] конкретное время."],
    "帰る" : ["かえる", "возвращаться, уходить домой"],
    "晩ご飯　｜　晩飯" : ["ばんごはん (вежл) ｜ ばんめし", "\n ужин[вечер\\закат ばん][приём пищи　はん]"],
    "食べません" : ["たべません", "Есть не буду."],
    "寝る" : ["ねる", "спать\\ложится спать"],
    "起きる" : ["おきる", "вставать\\просыпаться"],
    "帽子" : ["ぼうし", "шапка"],
    "" : ["", ""],
}

WORDS_TO_LEARN = {
    "たいてい": ["たいてい", "обычно\\чаще всего"],
    "そうですね" : ["そうですね", "ды, согласен\\Согласие со сказанным. "],
    "うち" : ["うち", "дом\\семья"],
    "でも" : ["でも", ", но"],
    "ときどき" : ["ときどき", "иногда\\порой"],
    "みる" : ["みる", "смотреть"],
    "ええ" : ["ええ", "Да"],
    "いいえ" : ["いいえ", "нет"],
    "*ごろ" : ["*ごろ", "*примерно"],
    "じゃあ、いってらっしゃい" : ["じゃあ、いってらっしゃい", "Да и ладно, иди. (Усиленная форма)"],
    "" : ["", ""],

}

KANGI_SET = {}
KANGI_SET.update(KANZI_WITH_LOVE_N5)
KANGI_SET.update(GENKI_KANGI)
KANGI_SET.update(WORDS_TO_LEARN)